public/ephemeris/2025-05-14.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="ephemeris.html">Ephemeris</a> &gt; <a href="entries.html">Entries</a> &gt;
</p>

<div id="outline-container-org6b79d82" class="outline-2">
<h2 id="org6b79d82">2025-05-14 - The role of theater in my life</h2>
<div class="outline-text-2" id="text-org6b79d82">
<p>
Today I went to theater as a spectator after exactly one year since
the last time I step in a stage (and I was an actor!), which made me
reflect on the role of theater in my life and the fact that Its time
has come to an end for me. I feel like I have no interest to enter a
theater on my own and I surely don't have the time and mental space to
participate anymore. This moment concludes a journey of 4 years where
theater was a part of my life and now it's not, I will now explain my
journey and my thoughts.
</p>

<p>
I started theater in my last year of high school and I consider this
one of my bravest decision I ever did. I was a very introverted and
shy person (still am) and I was constantly blocked by my own self
doubt and a lack of social skills. At least I was doing great at CTF
competitions :). In the summer between my fourth and fifth (last) year
of high school I was at a point where I needed to get out there and
push myself hard, so I did and one of the things was joining a theater
class organized by my school. Surely the fact that everything was
setup by my school reduced friction. In fact, I consider myself lucky
because many schools do not have a theater group and mine had just
been created one or two years prior. If it weren't in the school I
probably would have never joined. So I was in theater, actually there
was a short creative writing class before that with the same people so
I got introduced to the group. My god that felt awkward at first, but
I slowly became more comfortable with the exercises and with the
group. By the end, going to the lessons was surely my favorite
activity (after installing Linux everywhere obviously) and It gave me
a lot of motivation and self confidence. I have to say that the
teachers were truly amazing, so was the group and the exercises. My
best memories of high school are all from theater.
</p>

<p>
But life moves on and I moved to another city far from home to pursue
my bachelor degree in computer science. My first year was a year of
great change and discovery, and I decided to keep doing theater. I
joined a local group I found via some fliers hoping to relive some
stress from university. But I was really stressed and pressured daily
so I could not fully enjoy it. Moreover, the experience was completely
different and instead of doing classic theater "creative" exercises,
we were tasked to create our own show by the end of the course. This
was a different thing than the previous year and, while it was not
bad, It was not great neither. I am perfectly conscious that the main
reason for why I didn't enjoy It It's my own fault: I was unable to let
go of myself and university was giving me a constant level of anxiety
and pressure that sat on me at any moment. The people were great too
but as I said I was the principal cause of friction.
</p>

<p>
It's now my second year of university and I decided to try theater
again, this time with another group. And none other that ATU which I
knew was the best of the best, and It was. I got selected in the group
and the lessons started, each Monday evening, in a huge theater all
for ourselves. This was a step higher than anything that I had ever
tried before, both in terms of "professionalism" and intensity.  And
surely It was intense, too much intense for me. The group was a really
active and strong one, I felt like I was the only introverted in the
room and that made me distance from the rest. Let's say that I felt
this distance increasing more and more as time passed, in particular I
discovered how much of a calm and silent person I am and how much I
really felt uncomfortable around such loud and excited people. So far
I have always kept pushing myself to get out of my own "cage" and
socialize with others, but this group completely smashed the limits
until It had the opposite effect of what It should have had giving me
a lot of anxiety. Furthermore, as the final play was getting closer,
the intensity of the lessons kept increasing. So were my university
classes and the date of the exams. By the end of the class, I was
totally overworked, sleep-deprived, stressed and anxious to the point
where this led me to a huge burnout. I was not meant to do theater, I
thought.
</p>

<p>
And so I didn't try again another year and I decided to focus on my
studies, leaving behind everything else. It's now been I year since I
stepped into a theater and I have to say that the distance between
theater and me kept increasing every day. The distance between that
life of constant stimulus and excitement, and my life of stability and
peacefulness are not compatible anymore. I never wanted that life, It
does not feel natural to me.
</p>

<p>
Doing all those years of theater has been a great experience of
discovering myself, the good and the bad.  As I transition from an
university student to a worker, I have so much things to think about
that I can't take some more. I don't feel like I have the motivation
since I am now driven by different ideals. Either way, doing theater
helped me change the course of my life and I will keep this memory in
my heart, with some bitterness and sadness that It came to an end.
</p>

<hr />

<p>
Travel: <a href="ephemeris.html">Ephemeris</a>, <a href="../theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</body>
</html>
